# MEPNetworkSegmentId Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentId Constructor
MEPNetworkSegmentId Class See Also
---
Creates a default invalid segment id on the network.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public MEPNetworkSegmentId()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
MEPNetworkSegmentId()
```

# See Also
MEPNetworkSegmentId Class
MEPNetworkSegmentId Overload
Autodesk.Revit.DB.Analysis Namespace